wootcot/smart-demand-response-gateway/firmware/sdkconfig.defaults
# Target the ESP32-WROOM-32 microcontroller (dual-core Xtensa LX6)
CONFIG_IDF_TARGET="esp32"

# Gateway Configuration defaults (override via `idf.py menuconfig` or NVS)
CONFIG_GATEWAY_WIFI_SSID="my_network"
CONFIG_GATEWAY_WIFI_PASS=""
CONFIG_GATEWAY_WS_HOST="192.168.1.100"
CONFIG_GATEWAY_WS_PORT=8080
CONFIG_GATEWAY_ID="esp32-gw-001"
